[{"values": [{"description": "Aggah is an attack campaign identified by PaloAlto that targets not only Middle East countries but also the United States, and throughout Europe and Asia. Related delivery documents follow the same process to ultimately install RevengeRAT hosted on Pastebin.", "meta": {"refs": ["https://unit42.paloaltonetworks.com/aggah-campaign-bit-ly-blogspot-and-pastebin-used-for-c2-in-large-scale-campaign/"]}, "value": "Aggah", "alias": ""}]}, {"values": [{"description": "APT-C-01, uncovered by QiAnXin Threat Intelligence Center, is an APT group located in Taiwan, China. The earliest activity could trace back to the year of 2007.", "meta": {"refs": ["https://ti.qianxin.com/uploads/2018/09/20/6f8ad451646c9eda1f75c5d31f39f668.pdf"]}, "value": "APT-C-01", "alias": "穷奇, APT-C-01, 绿斑, GreenSpot, 白海豚, 毒云藤"}]}, {"values": [{"description": "APT-C-15 is related to cyber espionage activities in the Middle East targeting countries such as Egypt and Israel to steal confidential information. Related attacks could trace back to December 2011 and was quite active from June 2014 to November 2015.", "meta": {"refs": ["https://ti.qianxin.com/uploads/2018/01/26/554041d1d8ead9711ca04b1dc8daa744.pdf"]}, "value": "APT-C-15", "alias": "人面狮, Sphinx, APT-C-15"}]}, {"values": [{"description": "Since May 2016, APT-C-23 carried out organized and persistent attacks against important areas such as Palestinian educational institutions and military institutions. Native Arabic-speaking cybercriminals have built advanced methods and tools to deliver, hide and operate malware to compromise Windows and Android platform used by specific targets.\n\nSubsequently, some foreign security vendors also linked the Big Bang attack to APT-C-23.", "meta": {"refs": ["https://ti.qianxin.com/uploads/2018/01/26/f41a337e10e992f17986af386a62c7ad.pdf"]}, "value": "APT-C-23", "alias": "双尾蝎, Arid Viper, Desert Falcon, AridViper, Big Bang, APT-C-23"}]}, {"values": [{"description": "APT-C-27 is located in the Syrian region with ability to attack Windows and Android platform. It was also mentioned out by Lookout in the Blackhat Europe 2018 while disclosing the Syrian Electronic Army’s mobile tool", "meta": {"refs": ["https://i.blackhat.com/eu-18/Wed-Dec-5/eu-18-DelRosso-Under-the-SEA.pdf  \nhttps://ti.qianxin.com/blog/articles/apt-c-27-(goldmouse):-suspected-target-attack-against-the-middle-east-with-winrar-exploit-en/"]}, "value": "APT-C-27", "alias": "黄金鼠, Goldmouse, APT-C-27"}]}, {"values": [{"description": "APT-C-36, also known as Blind Eagle, is a targeted attack group disclosed by QiAnXin. Suspected coming from South America, this attack group carried out continuous targeted attacks against Colombian government institutions as well as important corporations in financial sector, petroleum industry, professional manufacturing, etc.\nAttackers like to use spear-fishing email with password protected RAR attachment to avoid being detected by the email gateway. Its purpose is to implant Imminent backdoor and gain a foothold into the target network which may make the follow up lateral movement easier to implement.\nBased upon victims’ backgrounds, the attacker is focusing on strategic-level intelligence and may also have motivations to steal business intelligence and intellectual properties.", "meta": {"refs": ["https://ti.qianxin.com/blog/articles/apt-c-36-continuous-attacks-targeting-colombian-government-institutions-and-corporations-en/"]}, "value": "APT-C-36", "alias": "盲眼鹰"}]}, {"values": [{"description": "APT-C-37, also known as Pat Bear, has launched an organized, planned, and targeted long-term uninterrupted attack against an armed organization. Both Windows and Android are the targeted systems.\nPayload is delivered mainly through watering-hole attacks. One of the C2 is located in the Middle East inside the same network used by Golden Mouse.", "meta": {"refs": ["http://blogs.360.cn/post/analysis-of-apt-c-37.html"]}, "value": "APT-C-37", "alias": "拍拍熊"}]}, {"values": [{"description": "Attacks carried out by APT1 could trace back to 2006. This attack group is attributed to PLA Unit by FireEye. According to the report, more than 100 organizations are affected and hundreds of terabytes of data get stolen.", "meta": {"refs": ["https://www.fireeye.com/content/dam/fireeye-www/services/pdfs/mandiant-apt1-report.pdf"]}, "value": "APT1", "alias": "Comment Panda, PLA Unit 61398, APT 1, Advanced Persistent Threat 1, Byzantine Candor, Group 3, TG-8223, Comment Group, Brown Fox, Comment Crew, APT1"}]}, {"values": [{"description": "APT10 is the name given to a group of Chinese hackers first identified by FireEye. The group is said to have taken gigabytes of sensitive data from firms involved in the fields of aviation, space and satellite, manufacturing, pharmaceuticals, oil and gas exploration, communications, computer processor and maritime.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html"]}, "value": "APT10", "alias": "Stone Panda, APT 10, menuPass, happyyongzi, POTASSIUM, DustStorm, Red Apollo, CVNX, HOGFISH, APT10"}]}, {"values": [{"description": "APT15 is a threat group that has been active since at least 2010 and targeted several industries, including oil, government, military, and more. FireEye mentioned that the attackers may be operating from China while their exact identities and motivation remain unknown.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2014/09/forced-to-adapt-xslcmd-backdoor-now-on-os-x.html  \nhttps://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-operation-ke3chang.pdf"]}, "value": "APT15", "alias": "Vixen Panda, APT15, APT 15, Royal APT, Playful Dragon, GREF, Metushy, Lurid, Social Network Team, Mirage, APT15, Ke3chang"}]}, {"values": [{"description": "APT16 actors sent spear phishing emails to media organizations and webmail addresses. In FireEye’s report, it is said that the Chinese government would benefit from improved insight into local media coverage, so they attribute the phishing campaign to the China-based APT group and refer to as APT16", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2015/12/the-eps-awakens-part-two.html  \nhttps://www.fireeye.com/blog/threat-research/2015/12/the_eps_awakens.html"]}, "value": "APT16", "alias": "APT 16, APT16"}]}, {"values": [{"description": "APT17 is said to be a China-based threat group that has conducted network intrusions against U.S. government entities, the defense industry, law firms, information technology companies, mining companies, and non-government organizations.", "meta": {"refs": ["http://www.fireeye.com/blog/technical/cyber-exploits/2013/09/operation-deputydog-zero-day-cve-2013-3893-attack-against-japanese-targets.html\nhttp://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/hidden_lynx.pdf\nhttps://www2.fireeye.com/rs/fireye/images/APT17_Report.pdf"]}, "value": "APT17", "alias": "Aurora Panda, APT 17, Deputy Dog, Group 8, Hidden Lynx, Tailgater Team, Axiom, Winnti Group, Group 72, Group72, Tailgater, Ragebeast, Blackfly, Lead, Wicked Spider, APT 17, Dogfish, Wicked Panda, Barium, APT17"}]}, {"values": [{"description": "APT19 is reported to be Chinese-based threat group that has targeted a variety of industries, including defense, finance, energy, pharmaceutical, telecommunications, high tech, education, manufacturing, and legal services.", "meta": {"refs": ["https://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/\nhttp://www.crowdstrike.com/blog/cyber-deterrence-in-action-a-story-of-one-long-hurricane-panda-campaign/"]}, "value": "APT19", "alias": "Shell Crew, WebMasters, APT 19, KungFu Kittens, Black Vine, Group 13, PinkPanther, Sh3llCr3w, TEMP.Avengers, Hurricane Panda, Codoso, C0d0so0, Deep Panda, Sunshop Group, APT19"}]}, {"values": [{"description": "APT23, also known as Tropic Trooper, focuses on government, healthcare, transportation, and high-tech industries. According to the report from Trend Micro, its operators are believed to be very organized and develop their own cyberespionage tools that they fine-tuned in their campaigns.", "meta": {"refs": ["https://blog.trendmicro.com/trendlabs-security-intelligence/tropic-trooper-new-strategy/"]}, "value": "APT23", "alias": "Pirate Panda, KeyBoy, Tropic Trooper, APT23"}]}, {"values": [{"description": "The actor has been observed targeting hundreds of organizations all around the world, including U.S. defense contractors, financial services firms, a European drone maker, and a national data center in Central Asia.\n\nThis APT group is active since at least 2010 with various purposes, ranging from stealing data about cutting-edge weapons technologies to spying on dissidents and other civilian groups. Palo Alto observed its malicious activity in  April 2019 which may indicate the attack group is still active.", "meta": {"refs": ["https://www.secureworks.com/research/threat-group-3390-targets-organizations-for-cyberespionage\nhttps://www.secureworks.com/research/bronze-union\nhttps://www.bleepingcomputer.com/news/security/chinese-cyber-espionage-group-hacked-government-data-center/\nhttp://newsroom.trendmicro.com/blog/operation-iron-tiger-attackers-shift-east-asia-united-states\nhttps://www.threatconnect.com/blog/threatconnect-discovers-chinese-apt-activity-in-europe/"]}, "value": "APT27", "alias": "EmissaryPanda, LuckyMouse, Emissary Panda, TG-3390, APT 27, TEMP.Hippo, Group 35, Bronze Union, ZipToken, HIPPOTeam, Operation Iron Tiger, Iron Tiger APT, Threat Group-3390, APT27"}]}, {"values": [{"description": "APT28, attributed to a Russian cyber espionage group, has been active since at least 2004. It is reported that this group targets insider information related to governments, militaries, and security organizations that would likely benefit the Russian government. This APT group carry out attacks frequently and may have attempt to interfere with the U.S. presidential election. The coding practices evident in the group’s malware suggest both a high level of skill and an interest in complicating reverse engineering efforts.", "meta": {"refs": ["https://securelist.com/a-slice-of-2017-sofacy-activity/83930/\nhttps://blog.trendmicro.com/trendlabs-security-intelligence/new-adobe-flash-zero-day-used-in-pawn-storm-campaign/"]}, "value": "APT28", "alias": "Pawn Storm, Sednit, Fancy Bear, Sofacy, Sofacy Group, STRONTIUM, Tsar Team, Threat Group-4127, TG-4127, Iron Twilight, GRIZZLY STEPPE, Group 74, T-APT-12, TAG_0700, Swallowtail, SNAKEMACKEREL, APT-C-20, APT28"}]}, {"values": [{"description": "APT29 has operated since at least 2008 and attributed to the Russian government in public reports. It is regarded as a well-resourced, highly dedicated, and organized cyber-espionage group to collect intelligence in support of foreign and security policy decision-making.\n\nIt tries to undermine the detection of the malware by adding layers of obfuscation and mimicking the behavior of legitimate users. Analysis report points out the malware toolsets used by APT29 are the product of a single, large, well-resourced organization that provides the Russian government with intelligence on foreign and security policy matters in exchange for support and protection.", "meta": {"refs": ["https://www.f-secure.com/documents/996508/1030745/dukes_whitepaper.pdf\nhttps://www.us-cert.gov/sites/default/files/publications/JAR_16-20296A_GRIZZLY%20STEPPE-2016-1229.pdf\nhttps://www.crowdstrike.com/blog/bears-midst-intrusion-democratic-national-committee/\nhttps://labsblog.f-secure.com/2015/09/17/the-dukes-7-years-of-russian-cyber-espionage/\nhttps://www2.fireeye.com/rs/848-DID-242/images/rpt-apt29-hammertoss.pdf\nhttps://www.us-cert.gov/sites/default/files/publications/AR-17-20045_Enhanced_Analysis_of_GRIZZLY_STEPPE_Activity.pdf\nhttps://www.fireeye.com/blog/threat-research/2017/03/dissecting_one_ofap.html"]}, "value": "APT29", "alias": "Cozy Bear, Cozy Duke, The Dukes, Dukes, Group 100, CozyDuke, EuroAPT, CozyBear, CozyCar, Cozer, Office Monkeys, OfficeMonkeys, Minidionis, SeaDuke, Hammer Toss, APT29"}]}, {"values": [{"description": "It is reported that APT3 has traditionally targeted a wide-range of companies and technologies, likely to fulfill intelligence collection requirements on behalf of the MSS. This group is responsible for the campaigns known as Operation Clandestine Fox, Operation Clandestine Wolf, and Operation Double Tap.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2015/06/operation-clandestine-wolf-adobe-flash-zero-day.html  \nhttps://www.fireeye.com/blog/threat-research/2014/11/operation_doubletap.html"]}, "value": "APT3", "alias": "UPS, Gothic Panda, TG-0110, Group 6, UPS Team, APT 3, Buckeye, Pirpi, Threat Group-0110, APT3"}]}, {"values": [{"description": "APT33 is a capable group that has carried out cyber espionage operations since at least 2013. It is reported that this attack group works at the behest of the Iranian government. They target organizations headquartered in the United States, Saudi Arabia and South Korea, and have particular interest in the aviation sector involved in both military and commercial capacities, as well as organizations in the energy sector with ties to petrochemical production", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2017/09/apt33-insights-into-iranian-cyber-espionage.html  \nhttps://www.brighttalk.com/webcast/10703/275683  \nhttps://dragos.com/adversaries.html  \nhttps://dragos.com/media/2017-Review-Industrial-Control-System-Threats.pdf  \nhttps://securelist.com/twas-the-night-before/91599/"]}, "value": "APT33", "alias": "MAGNALLIUM, Elfin, Holmium, Refined Kitten, NewsBeef , APT33"}]}, {"values": [{"description": "APT37 is a suspected North Korean cyber espionage group that has been in operation since at least 2012. Their targets are primarily located in South Korea, but also Japan, Vietnam, Russia, China, India, and some of the countries in the Middle East. A wider range of industries are affected, including chemicals, electronics, manufacturing, aerospace, automotive and healthcare entities", "meta": {"refs": ["https://www2.fireeye.com/rs/848-DID-242/images/rpt_APT37.pdf  \nhttps://securelist.com/operation-daybreak/75100/  \nhttps://securelist.com/scarcruft-continues-to-evolve-introduces-bluetooth-harvester/90729/"]}, "value": "APT37", "alias": "Reaper group, Geumseong121, Group 123, Scarcruft, APT-S-008, Red Eyes, TEMP.Reaper, Ricochet Chollima, sun team, APT37"}]}, {"values": [{"description": "The actor is reported to have conducted operations since at least 2013, specifically targeted engineering, transportation, and the defense industry, especially where these sectors overlap with maritime technologies.\nMalwares utilized by this APT group are named as DADBOD, AIRBREAK, EVILTECH, HOMEFRY, MURKYTOP, HTRAN, and SCANBOX.", "meta": {"refs": ["https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets  \nhttps://www.fireeye.com/blog/threat-research/2018/03/suspected-chinese-espionage-group-targeting-maritime-and-engineering-industries.html  \nhttps://www.fireeye.com/blog/threat-research/2018/07/chinese-espionage-group-targets-cambodia-ahead-of-elections.html  \nhttps://www.f-secure.com/documents/996508/1030745/nanhaishu_whitepaper.pdf"]}, "value": "APT40", "alias": "TEMP.Periscope, TEMP.Jumper, NanHaiShu, Leviathan, Mudcarp, APT40"}]}, {"values": [{"description": "APT41, active since as early as 2012, is reported to carry out espionage activities sponsored by Chinese government. It has financial motivations as well and has been observed targeting healthcare, telecom, technology, and video game industries in 14 countries.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2019/08/apt41-dual-espionage-and-cyber-crime-operation.html"]}, "value": "APT41", "alias": ""}]}, {"values": [{"description": "Attor is an espionage platform with a complex architecture uncovered by ESET. Its GSM plugin uses the AT command protocol, and second, it uses Tor for its network communications.\nAttor’s espionage operation is highly targeted. The platform was used in targeted attacks against diplomatic missions and governmental institutions, and privacy-concerned users since at least 2013.", "meta": {"refs": ["https://www.welivesecurity.com/2019/10/10/eset-discovers-attor-spy-platform/"]}, "value": "Attor", "alias": ""}]}, {"values": [{"description": "As early as 2013, COSEINC and FireEye disclosed Bisonal's attack against Japan. In October 2017, AhnLab uncovered the Operation Bitter Biscuit attack against South Korea, Japan, India and Russia.\nUnit 42 observed related attack on a Russian defense company and a South Korean company in May 2018 with similar variant that could be trace back to 2014. The main difference is that the network communication is overwritten and the encryption algorithm is different. It is an executable file disguised as PDF for distribution and uses DDNS as C2.", "meta": {"refs": ["https://camal.coseinc.com/publish/2013Bisonal.pdf  \nhttps://www.rsaconference.com/writable/presentations/file_upload/cle-t04_final_v1.pdf  \nhttp://asec.ahnlab.com/tag/Operation%20Bitter%20Biscuit  \nhttps://researchcenter.paloaltonetworks.com/2018/07/unit42-bisonal-malware-used-attacks-russia-south-korea/"]}, "value": "Bisonal", "alias": ""}]}, {"values": [{"description": "The BITTER attack began in November 2013 while without being observed for many years. The attackers could compromise Windows and Android platform but their background is not yet clear.\nThe first sample appeared in November 2013, and many of the rest are compile from July 2015 to September 2016. Samples targeting Chinese victims are compiled from May to September 2016. Related network activities are concentrated in September and C2s are still alive.\nThe QiAnXin Threat Intelligence Center subsequently discovered that the attack group utilized the InPage vulnerability and pointed out the relationship to Confucius and APT-C-09.", "meta": {"refs": ["https://www.anomali.com/blog/suspected-bitter-apt-continues-targeting-government-of-china-and-chinese-organizations"]}, "value": "BITTER", "alias": "蔓灵花"}]}, {"values": [{"description": "Blackgear is an espionage campaign which has targeted users in Japan, Korea and China (Taiwan) for many years. Protux was frequently used to target public institutions and high-tech industries. Related Elirks malware was also captured by Trend Micro in 2016 while targeting Japan. The malware usually uses blogs, Weibo and social networks for C2 communications.", "meta": {"refs": ["https://blog.trendmicro.com/trendlabs-security-intelligence/blackgear-cyberespionage-campaign-resurfaces-abuses-social-media-for-cc-communication/"]}, "value": "Blackgear", "alias": "Topgear, Comnie, Blackgear"}]}, {"values": [{"description": "BlackOasis is a Middle Eastern threat group that is believed to be a customer of Gamma Group. The group has shown interest in prominent figures in the United Nations, as well as opposition bloggers, activists, regional news correspondents, and think tanks. A group known by Microsoft as Neodymium is reportedly associated closely with BlackOasis operations, but evidence to indicate the group names are aliases has not been identified.", "meta": {"refs": ["https://securelist.com/blackoasis-apt-and-new-targeted-attacks-leveraging-zero-day-exploit/82732/  \nhttps://securelist.com/apt-trends-report-q2-2017/79332/  \nhttps://www.cyberscoop.com/middle-eastern-hacking-group-using-finfisher-malware-conduct-international-espionage/"]}, "value": "BlackOasis", "alias": ""}]}, {"values": [{"description": "BlackTech is an APT group operating against targets in East Asia, such as Japan and China (Hong Kong, Taiwan). BlackTech’s campaigns are likely designed to steal their target’s technology. There are three associated campaigns: PLEAD, Shrouded Crossbow and Waterbea", "meta": {"refs": ["https://www.welivesecurity.com/2018/07/09/certificates-stolen-taiwanese-tech-companies-plead-malware-campaign/  \nhttps://blog.trendmicro.com/trendlabs-security-intelligence/following-trail-blacktech-cyber-espionage-campaigns/"]}, "value": "BlackTech", "alias": "PLEAD, Shrouded Crossbow, Waterbear, Radio Panda, BlackTech"}]}, {"values": [{"description": "APT-C-12, also known as Blue Mushroom, is an APT group first disclosed by QiAnXin. It carried out continuous cyber espionage activities targeting key units and departments such as the government, military industry, scientific research, and finance since 2011, to exfiltrate sensitive information relating to the nuclear industry and research in China. Related attack campaign was named as Operation NuclearCrisis.\n\nThe attack group usually adopts spear-phishing technology to deliver malicious binary payloads. Cloud services are abused as C2, and also to store the stolen data.", "meta": {"refs": ["https://ti.qianxin.com/uploads/2018/07/05/5fc9c36b4cb81d4281599f0d3416931a.pdf"]}, "value": "BlueMushroom", "alias": "APT-C-12, 核危机, BlueMushroom, 蓝宝菇"}]}, {"values": [{"description": "Based on the contents of the associated decoys documents, as well as several of the dynamic DNS domain names used to host C2 servers, it is speculated that Bookworm targets organizations in Thailand to grab confidential intelligence.", "meta": {"refs": ["https://unit42.paloaltonetworks.com/bookworm-trojan-a-model-of-modular-architecture/"]}, "value": "Bookworm", "alias": ""}]}, {"values": [{"description": "Buhtrap has been active since 2014 while their first attacks against financial institutions were detected in August 2015. It focuses on banking clients as well as Russian and Ukrainian banks.\nFrom August 2015 to February 2016, Buhtrap managed to conduct 13 successful attacks against Russian banks for a total amount of $25.7 million. The number of successful attacks against Ukrainian banks has not been identified.", "meta": {"refs": ["http://www.welivesecurity.com/2015/11/11/operation-buhtrap-malware-distributed-via-ammyy-com/  \nhttps://www.welivesecurity.com/2019/07/11/buhtrap-zero-day-espionage-campaigns/"]}, "value": "Buhtrap", "alias": "RATPAK SPIDER, Buhtrap"}]}, {"values": [{"description": "C-Major targeted Indian military officials via spear-phishing emails, distributing spyware to its victims via an Adobe Reader vulnerability.", "meta": {"refs": ["http://documents.trendmicro.com/assets/pdf/Indian-military-personnel-targeted-by-information-theft-campaign-cmajor.pdf"]}, "value": "C-Major", "alias": "ProjectM, Transparent Tribe, Operation C-Major, C-Major"}]}, {"values": [{"description": "Calypso is an APT group attacking state institutions that has been active since at least September 2016. The primary goal of the group is theft of confidential data. Main targets are governmental institutions in Brazil, India, Kazakhstan, Russia, Thailand, and Turkey.", "meta": {"refs": ["https://www.ptsecurity.com/ww-en/analytics/calypso-apt-2019/#id5"]}, "value": "Calypso", "alias": ""}]}, {"values": [{"description": "CARROTBAT is a dropper utilized in a campaign to deliver lures primarily pertaining to the South Korea and North Korea region.\nRelated activity was initially discovered in an attack on December 2017 against a British government agency using the SYSCON malware family. Palo Alto found that there was infrastructure overlap between the CARROTBAT and KONNI malware families. Finding CARROTBAT provided an important keystone in identifying Fractured Block Campaign activity to make them able to find related OceanSalt, SYSCON and KONNI activity.", "meta": {"refs": ["https://researchcenter.paloaltonetworks.com/2018/11/unit42-the-fractured-block-campaign-carrotbat-malware-used-to-deliver-malware-targeting-southeast-asia/#appendix"]}, "value": "CARROTBAT", "alias": "Fractured Block"}]}, {"values": [{"description": "Chafer’s (also known as APT39) focus on the telecommunications and travel industries suggests intent to perform monitoring, tracking, or surveillance operations against specific individuals. While its targeting scope is global, the activities are concentrated in the Middle East. Government entities targeting suggests a potential secondary intent to collect geopolitical data that may benefit nation-state decision making.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2019/01/apt39-iranian-cyber-espionage-group-focused-on-personal-information.html  \nhttps://mp.weixin.qq.com/s/c2z4laJ0oq5y0BAEFM3Y9w"]}, "value": "Chafer", "alias": "APT39, Chafer"}]}, {"values": [{"description": "Charming Kitten is an Iranian cyberespionage group that has been active since around 2014. They appear to focus on targeting individuals of interest to Iran who work in academic research, human rights, and media, with most victims having been located in Iran, the US, Israel, and the UK. It usually tries to access private email and Facebook accounts, and sometimes establishes a foothold on victim computers.\nThe group's TTPs overlap extensively with another group, Rocket Kitten.", "meta": {"refs": ["https://en.wikipedia.org/wiki/Operation_Newscaster  \nhttps://iranthreats.github.io/resources/macdownloader-macos-malware/  \nhttps://www.isightpartners.com/2014/05/newscaster-iranian-threat-inside-social-media/  \nhttps://www.forbes.com/sites/thomasbrewster/2017/07/27/iran-hackers-oilrig-use-fake-personas-on-facebook-linkedin-for-cyberespionage/  \nhttps://cryptome.org/2012/11/parastoo-hacks-iaea.htm  \nhttps://securelist.com/files/2017/03/Report_Shamoon_StoneDrill_final.pdf  \nhttps://securelist.com/blog/software/74503/freezer-paper-around-free-meat/  \nhttps://www.verfassungsschutz.de/download/broschuere-2016-10-bfv-cyber-brief-2016-04.pdf"]}, "value": "Charming Kitten", "alias": "Newscaster, Parastoo, iKittens, Group 83, Newsbeef, Charming Kitten"}]}, {"values": [{"description": "A campaign targeting Japanese academe, technology enterprises, media outfits, managed service providers, and government agencies. It employs various poisoned pawns in the form of malware-laden spear-phishing emails containing decoy documents.", "meta": {"refs": ["https://blog.trendmicro.com/trendlabs-security-intelligence/chessmaster-cyber-espionage-campaign/"]}, "value": "ChessMaster", "alias": ""}]}, {"values": [{"description": "An underground DDoS organization in China that deliver BillGates, DDOSClient and xorddos through SSH/Telnet brute forcing", "meta": {"refs": [""]}, "value": "ChinaZ", "alias": ""}]}, {"values": [{"description": "Cold River targets Middle Eastern organizations largely from the Lebanon and United Arab Emirates. The sophisticated threat actor making malicious use of DNS tunneling as well as the Django python framework for C2 activities.", "meta": {"refs": ["https://www.lastline.com/labsblog/threat-actor-cold-river-network-traffic-analysis-and-a-deep-dive-on-agent-drable/"]}, "value": "Cold River", "alias": ""}]}, {"values": [{"description": "Confucius’ campaigns were reportedly active as early as 2013 by Palo Alto. Subsequently, Trend Micro pointed out the connection to Patchwork.\nBoth Windows and Android are Confucius’ targets. From the analysis of threat intelligence data inside the QiAnXin Threat Intelligence Center, the two attack groups can be linked through the C2 domains used by similar Delphi dropper. Unlike Patchwork, Confucius’s targets are mainly located in Pakistan and India, and the origin usually disguised as sources of Russia.", "meta": {"refs": ["https://blog.trendmicro.com/trendlabs-security-intelligence/confucius-update-new-tools-and-techniques-further-connections-with-patchwork/"]}, "value": "Confucius", "alias": ""}]}, {"values": [{"description": "CopyKittens is regarded as an Iranian cyberespionage group that has been operating since at least 2013. It has targeted countries including Israel, Saudi Arabia,Turkey, the U.S., Jordan, and Germany. The group is responsible for the campaign known as Operation Wilted Tulip", "meta": {"refs": ["https://www.clearskysec.com/copykitten-jpost/  \nhttps://www.clearskysec.com/wp-content/uploads/2017/07/Operation_Wilted_Tulip.pdf  \nhttps://s3-eu-west-1.amazonaws.com/minervaresearchpublic/CopyKittens/CopyKittens.pdf  \nhttp://www.clearskysec.com/tulip/  \nhttps://blog.domaintools.com/2017/03/hunt-case-study-hunting-campaign-indicators-on-privacy-protected-attack-infrastructure/"]}, "value": "CopyKittens", "alias": "Slayer Kitten, CopyKittens"}]}, {"values": [{"description": "he CRASHOVERRIDE malware impacted a single transmission level substation in Ukraine on December 17th, 2016. It is the first ever malware framework designed and deployed to attack electric grids. The functionality in the CRASHOVERRIDE framework serves no espionage purpose and the only real feature of the malware is for attacks which would lead to electric outage", "meta": {"refs": [""]}, "value": "CRASHOVERRIDE", "alias": "Industroyer, CRASHOVERRIDE"}]}, {"values": [{"description": "Dark Caracal, a persistent and prolific actor, is believed to be administered out of a building belonging to the Lebanese General Security Directorate in Beirut. Hundreds of gigabytes of data have been exfiltrated since 2012, including enterprise intellectual property and personally identifiable information", "meta": {"refs": ["https://info.lookout.com/rs/051-ESQ-475/images/Lookout_Dark-Caracal_srr_20180118_us_v.1.0.pdf"]}, "value": "Dark Caracal", "alias": ""}]}, {"values": [{"description": "Dark Tequila is a complex malicious campaign targeting Mexican users, with the primary purpose of stealing financial information, as well as login credentials to popular websites that range from code versioning repositories to public file storage accounts and domain registrars. The campaign has been active since at least 2013 and there are two known infection vectors: spear-phishing and infection by USB device.", "meta": {"refs": ["https://securelist.com/dark-tequila-anejo/87528/"]}, "value": "Dark Tequila", "alias": ""}]}, {"values": [{"description": "The activities of the DarkHotel APT actor came to light in November 2014, when Kaspersky published a report detailing a sophisticated cyberespionage campaign targeting business travelers in the Asia-Pacific region. The group has been around for nearly a decade and some researchers believe its members are Korean speakers.\nThe attackers targeted their victims using several methods, including through their hotel’s Wi-Fi, zero-day exploits and peer-to-peer (P2P) file sharing websites.\nDarkHotel victims have been spotted in several countries, including North Korea, Russia, South Korea, Japan, Bangladesh, Thailand, Taiwan, China, the United States, India, Mozambique, Indonesia and Germany. Spear-phishing attacks are carried out by DarkHotel in recent years. Sever VBScript 0-day exploits were also used in the year of 2018.", "meta": {"refs": ["https://www.anquanke.com/post/id/107813"]}, "value": "Darkhotel", "alias": "Inexsmar, DUBNIUM, Fallout Team, Karba, Luder, Nemim, Tapaoux, APT-C-06, Darkhotel"}]}, {"values": [{"description": "DarkHydrus, disclosed by Palo Alto, is a threat group that has targeted government agencies and educational institutions in the Middle East since at least 2016. The group heavily leverages open-source tools and custom payloads for carrying out attacks. ClearSky pointed out that some domains overlapped with CopyKittens.", "meta": {"refs": ["https://unit42.paloaltonetworks.com/unit42-new-threat-actor-group-darkhydrus-targets-middle-east-government/"]}, "value": "DarkHydrus", "alias": "LazyMeerkat, DarkHydrus"}]}, {"values": [{"description": "DeadlyKiss, named by Telsy Cyber Threat Intelligence Unit, for expected conjunction of two different modules during its infection chain. The identified targets belong to the world of Internet Service Provider (ISP) and Asian region is the main targets pool.", "meta": {"refs": ["https://blog.telsy.com/wp-content/uploads/2019/09/DeadlyKiss_TAAR.pdf"]}, "value": "DEADLYKISS", "alias": ""}]}, {"values": [{"description": "Domestic Kitten is an Iranian Surveillance Operation that has been taking place since 2016 and, until now, has remained under the radar due to the artful deception of its attackers towards their targets.\nThrough the use of mobile applications, those behind the attack use fake decoy content to entice their victims to download such applications, which are in fact loaded with spyware to steal sensitive information. Interestingly, these targets include Kurdish and Turkish natives and ISIS supporters. All these targets are actually Iranians citizens.\nThe malware collects data including contact lists stored on the victim’s mobile device, phone call records, SMS messages, browser history and bookmarks, geo-location of the victim, photos, surrounding voice recordings and more", "meta": {"refs": ["https://research.checkpoint.com/domestic-kitten-an-iranian-surveillance-operation/"]}, "value": "Domestic Kitten", "alias": ""}]}, {"values": [{"description": "Donot, focusing on government agencies in South Asia, was named by ARBOR NETWORKS in January 2018. It is labeled as an APT and active since at least 2016. A variety of programming languages are used to develop components with modular architecture, and Google Docs is abused to store documents for C2 communication.\nThe QiAnXin Threat Intelligence Center also uncovered some more related attacks in the following.", "meta": {"refs": ["https://asert.arbornetworks.com/donot-team-leverages-new-modular-malware-framework-south-asia/  \nhttps://ti.qianxin.com/blog/articles/latest-activity-of-apt-c-35/  \nhttps://ti.qianxin.com/blog/articles/donot-group-is-targeting-pakistani-businessman-working-in-china-en/"]}, "value": "Donot", "alias": "肚脑虫, APT-C-35, SectorE02, Donot"}]}, {"values": [{"description": "DustSquad is a Russian-language cyberespionage actor that focuses on Central Asian users and diplomatic entities. One associated malicious program for Windows called Octopus that mostly targets diplomatic entities, which pretending to be Telegram Messenger with a Russian interface. Android system is their target as well", "meta": {"refs": ["https://securelist.com/octopus-infested-seas-of-central-asia/88200/"]}, "value": "DustSquad", "alias": ""}]}, {"values": [{"description": "Machete is a targeted attack campaign with Spanish speaking roots. It started in 2010 and was renewed with an improved infrastructure in 2012.\nMost of the victims are located in Venezuela, Ecuador, Colombia, Peru, Russia, Cuba, and Spain. The targets include high-level profiles, including intelligence services, military, embassies and government institutions. In some cases, such as Russia, the target appears to be an embassy from one of the countries of this list.", "meta": {"refs": ["https://securelist.com/blog/research/66108/el-machete/  \nhttps://www.cylance.com/en_us/blog/el-machete-malware-attacks-cut-through-latam.html"]}, "value": "El Machete", "alias": "Machete, El Machete"}]}, {"values": [{"description": "Energetic Bear is a cyberespionage group that has been active since at least 2011. They initially targeted defense and aviation companies but shifted to focus on the energy sector in early 2013. They have also targeted companies related to industrial control systems.\nThe attackers managed to compromise a number of strategically important organizations for spying purposes and could cause energy supply disruption in the affected areas.", "meta": {"refs": ["http://www.scmagazineuk.com/iran-and-russia-blamed-for-state-sponsored-espionage/article/330401/  \nhttp://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/Dragonfly_Threat_Against_Western_Energy_Suppliers.pdf  \nhttp://www.netresec.com/?page=Blog&month=2014-10&post=Full-Disclosure-of-Havex-Trojans  \nhttps://threatpost.com/energy-watering-hole-attack-used-lightsout-exploit-kit/104772/  \nhttps://dragos.com/adversaries.html  \nhttps://dragos.com/media/2017-Review-Industrial-Control-System-Threats.pdf  \nhttps://www.symantec.com/blogs/threat-intelligence/dragonfly-energy-sector-cyber-attacks"]}, "value": "Energetic Bear", "alias": "DragonFly, BlackEnergy, Black Energy, Crouching Yeti, Group 24, Havex, CrouchingYeti, Koala Team, DYMALLOY, Dragonfly2, Berserker Bear, Energetic Bear"}]}, {"values": [{"description": "Equation Group is probably the most sophisticated computer attack group in the world. It is suspected of being tied to the Tailored Access Operations (TAO) unit of the United States National Security Agency (NSA). Most of their targets have been in Iran, Russia, Pakistan, Afghanistan, India, Syria, and Mali.\nTheir arsenal of 0-day cyber weapons was stolen by an actor Shadow Brokers, who leaked a large section on the internet. Most notable among the dumps were 0-days such as ETERNALBLUE and ETERNALROMANCE that were later on used by other groups for the creation of infamous ransomware explosions such as WannaCry and NotPetya.\nEquation Group may also link to the creation of the Stuxnet worm that aimed to sabotage nuclear reactors in Iran in 2010, and/or the “follow-up” threats Duqu, Flame or Gauss.", "meta": {"refs": ["https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064459/Equation_group_questions_and_answers.pdf  \nhttps://en.wikipedia.org/wiki/Equation_Group"]}, "value": "Equation Group", "alias": "方程式, Tilded Team, Lamberts, Five Eyes, NSA,  GCHQ,  CSIS,  ASIS,  NZSIS, Equation Group"}]}, {"values": [{"description": "EvilGnome, discovered by Intezer, is a Linux backdoor disguised as a Gnome extension. Intezer’s investigation into EvilGnome yielded several similarities between the threat actors behind EvilGnome and Gamaredon Group", "meta": {"refs": ["https://www.intezer.com/blog-evilgnome-rare-malware-spying-on-linux-desktop-users/"]}, "value": "EvilGnome", "alias": ""}]}, {"values": [{"description": "FIN6, disclosed by FireEye, is a cybercriminal group intent on stealing payment card data for monetization. FIN6 actors had aggressively targeted and compromised POS systems, making off with millions of payment card numbers which will be sold on an underground criminal marketplace.", "meta": {"refs": ["https://www2.fireeye.com/rs/848-DID-242/images/rpt-fin6.pdf  \nhttps://www.fireeye.com/blog/threat-research/2019/04/pick-six-intercepting-a-fin6-intrusion.html"]}, "value": "FIN6", "alias": "ITG08, FIN6"}]}, {"values": [{"description": "FIN7 is a financially-motivated threat group that has primarily targeted the U.S. retail, restaurant, and hospitality sectors since 2015. FIN7 is sometimes referred to as Carbanak, Anunak, but these appear to be two groups using the same Carbanak malware.", "meta": {"refs": ["https://en.wikipedia.org/wiki/Carbanak  \nhttps://securelist.com/files/2015/02/Carbanak_APT_eng.pdf  \nhttp://2014.zeronights.ru/assets/files/slides/ivanovb-zeronights.pdf  \nhttps://www.symantec.com/connect/blogs/odinaff-new-trojan-used-high-level-financial-attacks  \nhttps://blog.cyber4sight.com/2017/04/similarities-between-carbanak-and-fin7-malware-suggest-actors-are-closely-related/  \nhttps://www.proofpoint.com/us/threat-insight/post/fin7carbanak-threat-actor-unleashes-bateleur-jscript-backdoor  \nhttps://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns  \nhttps://www.fireeye.com/blog/threat-research/2017/04/fin7-phishing-lnk.html  \nhttps://www.fireeye.com/blog/threat-research/2017/03/fin7_spear_phishing.html"]}, "value": "FIN7", "alias": "Carbanak, Anunak, JokerStash, Carberp, Carbon Spider, APT-C-11, FIN7"}]}, {"values": [{"description": "Gamaredon is labeled by Palo Alto and has been active since at least 2013. It primarily makes use of compromised domains, dynamic DNS providers, Russian and Ukrainian country code top-level domains (ccTLDs), and Russian hosting providers to distribute their custom-built malware. The attack group heavily relies on off-the-shelf tools in the beginning, then makes a shift to custom-developed malware which indicates the improvement of technical capabilities.", "meta": {"refs": ["https://researchcenter.paloaltonetworks.com/2017/02/unit-42-title-gamaredon-group-toolset-evolution/  \nhttps://www.lookingglasscyber.com/operation-armageddon-registration/  \nhttps://blog.yoroi.company/research/the-russian-shadow-in-eastern-europe-ukrainian-mod-campaign/  \nhttps://blog.yoroi.company/research/the-russian-shadow-in-eastern-europe-a-month-later/"]}, "value": "Gamaredon Group", "alias": ""}]}, {"values": [{"description": "", "meta": {"refs": [""]}, "value": "GlassRAT", "alias": ""}]}, {"values": [{"description": "Golden Chickens is a Malware-as-a-Service (MaaS) provider uncovered by QuoScient Intelligence Operations Team (QuoINT). There are two new threat actors: GC01 and GC02. From August to October 2018, GC01 carried out 9 spear-phishing attacks against financial institutions. GC02 performed 5 spear-phishing attacks from November 2017 to July 2018, targeting India and America. In the latter case, there are some overlaps with Gobalt infrastructure in May 2018. Related malwares are Venom and Taurus toolkit to create malicious document, as well as more_eggs (alias: Terra Loader，SpicyOmelette) for remote control", "meta": {"refs": ["https://medium.com/@quoscient/golden-chickens-uncovering-a-malware-as-a-service-maas-provider-and-two-new-threat-actors-using-61cf0cb87648"]}, "value": "Golden Chickens", "alias": ""}]}, {"values": [{"description": "Gorgon Group is a threat group consisting of members who are suspected to be Pakistan-based or have other connections to Pakistan. Palo Alto revealed a mix of criminal and targeted attacks carried out by this group, including campaigns against government organizations in the United Kingdom, Spain, Russia, and the United States. They are involved in both targeted and criminal attacks.\n\nAccording to the analysis of QiAnXin Threat Intelligence Center, Gorgon Group may link to Pakistan actors and relate to ProjectM.", "meta": {"refs": ["https://researchcenter.paloaltonetworks.com/2018/08/unit42-gorgon-group-slithering-nation-state-cybercrime/  \nhttps://researchcenter.paloaltonetworks.com/2017/10/unit42-tracking-subaat-targeted-phishing-attacks-point-leader-threat-actors-repository/  \nhttps://ti.qianxin.com/blog/articles/analysis-of-office-ole-sample/  \nhttps://paper.tuisec.win/detail/eaff0936fcdaaa6"]}, "value": "Gorgon", "alias": "Gorgon Group, Gorgon"}]}, {"values": [{"description": "GravityRAT is a malware utilized in APT attacks targeting India with evolving features. The threat, which is identified by Talos, uses a WMI request in order to get the current temperature of the hardware. There are four versions in total, developed over two years. The actor took their time to ensure they were not within a virtual environment to avoid analysis. However, they did not attempt to obfuscate their .NET code.", "meta": {"refs": ["https://blog.talosintelligence.com/2018/04/gravityrat-two-year-evolution-of-apt.html"]}, "value": "Gravityrat", "alias": ""}]}, {"values": [{"description": "GreyEnergy, named by ESET, exhibits many conceptual similarities with BlackEnergy. It is an important part of the arsenal of one of the most dangerous APT groups that has been terrorizing Ukraine for the past several years, and is deemed as the successor of the BlackEnergy toolkit. There are links that suggest the group behind GreyEnergy has been working together with the TeleBots group, known in connection with many destructive attacks.", "meta": {"refs": ["https://www.welivesecurity.com/2018/10/17/greyenergy-updated-arsenal-dangerous-threat-actors/  \nhttps://www.welivesecurity.com/wp-content/uploads/2018/10/ESET_GreyEnergy.pdf  \nhttps://github.com/eset/malware-ioc/tree/master/greyenergy"]}, "value": "GreyEnergy", "alias": ""}]}, {"values": [{"description": "HackingTeam was founded in 2003 by two Italian entrepreneurs. It is a Milan-based information technology company that sells offensive intrusion and surveillance capabilities to governments, law enforcement agencies and corporations\nIn July 2015, it suffered a damaging hack with 400GB of internal data – including the once-secret list of customers, internal communications, and spyware source code – leaked online. Since then, many 0-days collected by Hacking Team and became publicly available during the breach were used by several APT groups", "meta": {"refs": ["https://www.welivesecurity.com/2018/03/09/new-traces-hacking-team-wild/"]}, "value": "HackingTeam", "alias": ""}]}, {"values": [{"description": "The actor behind the Olympic Destroyer attack is called as Hades by Kaspersky. Olympic Destroyer is advanced attack that hit organizers, suppliers and partners of the Winter Olympic Games 2018 held in Pyeongchang, South Korea. It is a cyber-sabotage attack based on the spread of a destructive network worm. The sabotage stage was preceded by reconnaissance and infiltration into target networks to select the best foothold for the self-replicating and self-modifying destructive malware.", "meta": {"refs": ["https://cyware.com/news/new-olympic-destroyer-variant-being-distributed-by-the-hades-apt-group-e4b3cdb3"]}, "value": "Hades", "alias": "Gold Dragon, Olympic Destroyer, Hades"}]}, {"values": [{"description": "The Hellsing APT group, uncovered by Kaspersky, is active in the APAC region, hitting targets mainly in the South China Sea area, with a focus on Malaysia, the Philippines and Indonesia. The targeting of the Naikon group by the Hellsing APT is perhaps the most interesting part, since it seems more likely to be an APT-on-APT attack.", "meta": {"refs": ["https://securelist.com/the-chronicles-of-the-hellsing-apt-the-empire-strikes-back/69567/"]}, "value": "Hellsing", "alias": "Goblin Panda, Cycldek, Conimes, Gobelin Panda, Hellsing"}]}, {"values": [{"description": "HEXANE, also known as LYCEUM, is a threat group targets organizations in sectors of strategic national importance, including oil and gas and possibly telecommunications. Secureworks pointed out that it may have been active as early as April 2018. Domain registrations suggest that a campaign in mid-2018 focused on South African targets. In May 2019, the threat group launched a campaign against oil and gas organizations in the Middle East.", "meta": {"refs": ["https://www.secureworks.com/blog/lyceum-takes-center-stage-in-middle-east-campaign"]}, "value": "HEXANE", "alias": "LYCEUM, HEXANE"}]}, {"values": [{"description": "HexCode, named by ThreatBook, becomes active since at least 2016 and carries out long-term attacks on government, foreign affairs, intelligence agencies, medical and health departments in Western and Eastern Europe countries. This attack group is suspected to be from Russia.", "meta": {"refs": ["https://www.secrss.com/articles/14309"]}, "value": "HexCode", "alias": ""}]}, {"values": [{"description": "Higaisa, named by Tencent, is an attack group uses North Korea's important time nodes such as holidays to carry out fishing attacks since at least 2016. The targets include diplomatic entities, government officials, human rights organizations, oversea residents, and trade associates. Affected victims are located in China, North Korea, Japan, Nepal, Singapore, Russia, Poland, and Switzerland. The attack group is reported to be from South Korea.", "meta": {"refs": ["https://www.freebuf.com/news/219001.html"]}, "value": "Higaisa", "alias": "Higaisa, Higaisa, 黑格莎"}]}, {"values": [{"description": "Honeybee is an attack operation discovered by McAfee. It targets humanitarian aid organizations and using North Korean political topics as bait to lure victims into opening malicious Microsoft Word documents.\nThe actor behind Honeybee is likely a Korean speaker and has been operating with new implants since at least November 2017 with the first known version of NTWDBLIB installer.\nThis operation has expanded beyond the borders of South Korea to target Vietnam, Singapore, Argentina, Japan, Indonesia, and Canada.", "meta": {"refs": ["https://securingtomorrow.mcafee.com/mcafee-labs/mcafee-uncovers-operation-honeybee-malicious-document-campaign-targeting-humanitarian-aid-groups/"]}, "value": "Honeybee", "alias": ""}]}, {"values": [{"description": "Icefog, named by Kaspersky, is an APT that has been active since at least 2011, targeting mostly Japan and South Korea. Known targets include governmental institutions, military contractors, maritime and shipbuilding groups, telecom operators, industrial and high-tech companies and mass media.\nThis Icefog campaigns rely on custom-made cyber-espionage tools for Microsoft Windows and Apple Mac OS X. The operators process victims swiftly and in a surgical manner — locating and copying only specific, targeted information. Once the desired information is obtained, they abandon the infection and move on.", "meta": {"refs": ["https://securelist.com/blog/research/57331/the-icefog-apt-a-tale-of-cloak-and-three-daggers/  \nhttps://securelist.com/blog/incidents/58209/the-icefog-apt-hits-us-targets-with-java-backdoor/"]}, "value": "IceFog", "alias": "Dagger Panda, Ice Fog, Temp.Trident, Nomad Panda , TA428, IceFog, SectorB06"}]}, {"values": [{"description": "Inception Framework is an attack framework discovered by Symantec. Targets include individuals in strategic positions: Executives in important businesses such as oil, finance and engineering, military officers, embassy personnel and government officials. \nThe Inception attacks began by focusing on targets primarily located in Russia or related to Russian interests, but have since spread to targets in other locations around the world.", "meta": {"refs": ["https://www.symantec.com/blogs/threat-intelligence/inception-framework-hiding-behind-proxies"]}, "value": "Inception Framework", "alias": "Cloud Atlas, Inception Framework"}]}, {"values": [{"description": "Indrik Spider, revealed by CrowdStrike, is a sophisticated eCrime group that has been operating Dridex since June 2014. In 2015 and 2016, Dridex was one of the most prolific eCrime banking trojans on the market and, since 2014, those efforts are thought to have netted Indrik Spider millions of dollars in criminal profits.\nIn August 2017, a new ransomware variant identified as BitPaymer was reported to have ransomed the U.K.’s National Health Service (NHS). Later technical analysis of BitPaymer indicated that it had been developed by Indrik Spider, suggesting the group had expanded its criminal operation to include ransomware as a monetization strategy.", "meta": {"refs": ["https://www.crowdstrike.com/blog/big-game-hunting-the-evolution-of-indrik-spider-from-dridex-wire-fraud-to-bitpaymer-targeted-ransomware"]}, "value": "INDRIK SPIDER", "alias": ""}]}, {"values": [{"description": "It is an offshore APT organization that targets government agencies and has been attacking the Danish Ministry of Foreign Affairs for up to six years of cyber espionage. Related attacks can be traced back to April 2010, and the most recent attack was in January 2016.", "meta": {"refs": ["https://ti.qianxin.com/uploads/2018/01/26/ea9d6d29c2218746acaf87a68a2bbc1e.pdf  \nhttp://researchcenter.paloaltonetworks.com/2016/05/prince-of-persia-infy-malware-active-in-decade-of-targeted-attacks"]}, "value": "Infy group", "alias": "APT-C-07, Infy group, Operation Mermaid, APT-C-007, 美人鱼"}]}, {"values": [{"description": "Iron Group is a threat actor group known for ransomware attacks in the past. Palo Alto found a new malware family tie to the Iron Group that targets Linux and Microsoft Windows servers named XBash with ransomware and coin mining capabilities.", "meta": {"refs": ["https://researchcenter.paloaltonetworks.com/2018/09/unit42-xbash-combines-botnet-ransomware-coinmining-worm-targets-linux-windows"]}, "value": "Iron Group", "alias": ""}]}, {"values": [{"description": "The Kimsuky operators carry out ongoing cyber-espionage campaign against South Korean think-tanks. Following the intense diplomatic activity around the North Korea peace talks and the subsequent summit with the U.S. president in Singapore, Kimsuky decided to take advantage of this theme to distribute its malware in a new campaign. A massive update to its arsenal in late 2017 and early 2018 was mobilized in a new wave of spear-phishing emails.", "meta": {"refs": ["https://securelist.com/apt-trends-report-q2-2018/86487/  \nhttps://securelist.com/the-kimsuky-operation-a-north-korean-apt/57915/  \nhttp://blog.alyac.co.kr/1536  \nhttp://asec.ahnlab.com/993  \nhttps://blog.alyac.co.kr/2243  \nhttps://blog.alyac.co.kr/2315?category=957259"]}, "value": "Kimsuky", "alias": "Mystery Baby, Baby Coin, Smoke Screen, Kimsuky, BabyShark, Cobra Venom"}]}, {"values": [{"description": "KONNI is a malware cpatured and named by Talos, related activities could trace back to as early as 2014. Related victims are members of official organizations such as United Nations, UNICEF, and Embassies linked to North Korea.", "meta": {"refs": ["https://blog.talosintelligence.com/2017/05/konni-malware-under-radar-for-years.html"]}, "value": "KONNI", "alias": "Nokki, Moneyholic, KONNI"}]}, {"values": [{"description": "Kulak is reported to be a plan deployed by North Korea to develop malicious anti-virus software.", "meta": {"refs": ["https://blog.alyac.co.kr/2215"]}, "value": "Kulak", "alias": ""}]}, {"values": [{"description": "Lazarus Group, active since at least 2009, is an APT group that has been attributed to the North Korean. There are lots of campaigns connected, including Operation Blockbuster, Operation Flame, Operation 1Mission, Operation Troy, DarkSeoul, Ten Days of Rain, etc.\nIn November 2014, it carried out destructive wiping attack against Sony Pictures Entertainment. In 2016, it attacked Bangladesh central banks and stole US$81 million. In the middle of 2017, the WannaCry malware which leverages the leaked EternalBlue exploits affected as many as 300,000 computers worldwide.", "meta": {"refs": [""]}, "value": "Lazarus Group", "alias": "Operation DarkSeoul, Dark Seoul, Hidden Cobra, Hastati Group, Andariel Group, Unit 121, Bureau 121, NewRomanic Cyber Army Team, Bluenoroff, Group 77, Labyrinth Chollima, Operation Troy, Operation GhostSecret, Guardians of Peace, ZINC, NICKEL ACADEMY, APT-C-26, Silent Chollima, Lazarus Group"}]}, {"values": [{"description": "Leafminer, uncovered by Symantec, is an Iranian threat group that targeting a broad list of government organizations and business verticals in various regions in the Middle East since at least early 2017.", "meta": {"refs": ["https://www.jpost.com/Israel-News/Politics-And-Diplomacy/Report-Iran-targeted-Israel-in-cyber-attack-563937"]}, "value": "Leafminer", "alias": "RASPITE, Leafminer"}]}, {"values": [{"description": "According to ClearSky’s report, leetMX is a widespread cyber-attack campaign originating from Mexico and focused on targets in Mexico, El Salvador, and other countries in Latin America, such as Guatemala, Argentina and Costa Rica. It has been operating since at least November 2016.", "meta": {"refs": ["https://www.clearskysec.com/leetmx/"]}, "value": "leetMX", "alias": ""}]}, {"values": [{"description": "Longhorn is an attack group disclosed and named by Symantec. It has been active since at least 2011, and targeted at least 40 targets by using spying tools and operational protocols detailed in the recent Vault 7 leak.  The targets, compromised by advanced malware tools and zero-day vulnerabilities, are located in at least 16 countries across the Middle East, Europe, Asia, and Africa.", "meta": {"refs": ["https://www.symantec.com/connect/blogs/longhorn-tools-used-cyberespionage-group-linked-vault-7"]}, "value": "Longhorn", "alias": ""}]}, {"values": [{"description": "The LUNAR SPIDER threat group, disclosed by CrowdStrike, is the Eastern European-based operator and developer of the commodity banking malware called BokBot (aka IcedID), which was first observed in April 2017.", "meta": {"refs": ["https://www.crowdstrike.com/blog/sin-ful-spiders-wizard-spider-and-lunar-spider-sharing-the-same-web/"]}, "value": "LUNAR SPIDER", "alias": ""}]}, {"values": [{"description": "According to RiskIQ, Magecart is a rapidly growing cybercrime syndicate comprised of dozens of subgroups that specialize in cyberattacks involving digital credit card theft by skimming online payment forms. It also refers to the JavaScript code those groups inject.\nMagecart mainly targets e-commerce websites, aiming to inject their JavaScript skimmers on checkout pages. It also steals other types of sensitive, monetizable data entered into online web forms.", "meta": {"refs": ["https://www.bleepingcomputer.com/news/security/british-airways-fell-victim-to-card-scraping-attack/  \nhttps://www.bleepingcomputer.com/news/security/feedify-hacked-with-magecart-information-stealing-script/  \nhttps://www.bleepingcomputer.com/news/security/magecart-group-compromises-plugin-used-in-thousands-of-stores-makes-rookie-mistake/  \nhttps://www.bleepingcomputer.com/news/security/visiondirect-data-breach-caused-by-magecart-attack/  \nhttps://www.bleepingcomputer.com/news/security/magecart-group-sabotages-rival-to-ruin-data-and-reputation/"]}, "value": "MageCart", "alias": ""}]}, {"values": [{"description": "MartyMcFly is first discovered by Yoroi and found to targeting Italian naval industries. Kaspersky exposed a wider threat extension across multiple countries such as: Germany, Spain, and India. The group conducts massive campaigns that involve sending phishing emails to various companies, some of which are critical infrastructure facilities. The objective of such groups is to steal financial data and money.", "meta": {"refs": ["https://blog.yoroi.company/research/the-martymcfly-investigation-anchors-chain-case/"]}, "value": "MartyMcFly", "alias": ""}]}, {"values": [{"description": "Matryoshka, discovered by Fortinet, is a series of attacks targeted at service centers in Russia. These attacks use forged emails, malicious Office documents with exploits, and a commercial version of a RAT that is tucked into five different layers of protective packers.", "meta": {"refs": ["https://www.fortinet.com/blog/threat-research/non-russion-matryoshka-russian-service-centers-under-attack.html"]}, "value": "Matryoshka", "alias": ""}]}, {"values": [{"description": "The attackers used various techniques to evade detection and infect unsuspecting Portuguese-speaking users with banking Trojans. Public cloud infrastructure is utilized to help deliver the different stages and play a particularly big role in delivering the malicious payload. Legitimate signed binaries are also abused to load malicious code.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2018/04/metamorfo-campaign-targeting-brazilian-users.html"]}, "value": "Metamorfo", "alias": ""}]}, {"values": [{"description": "MM Core is a file-less Trojan discovered by FireEye in 2013 and typically used by APT actors to collect information from the infected device and establish a backdoor for remote access.", "meta": {"refs": ["https://www.cyber.nj.gov/threat-profiles/trojan-variants/mm-core"]}, "value": "MM CORE", "alias": ""}]}, {"values": [{"description": "Mofang is a threat actor named by Foxit. Is reported to be operated out of China and is probably government-affiliated. Mofang’s targets are probably selected based on involvement with investments, or technological advances, including those located in India, Germany, United States, Canada, Singapore and South Korea.", "meta": {"refs": ["https://blog.fox-it.com/2016/06/15/mofang-a-politically-motivated-information-stealing-adversary/  \nhttps://www.threatconnect.com/china-superman-apt/"]}, "value": "Mofang", "alias": "Superman, Mofang"}]}, {"values": [{"description": "Molerats, also known as Gaza Cybergang, is a politically-motivated threat group that has been operating since 2012. The group's victims are primarily in the Middle East, Europe, and the United States. In mid-2017, related attacks are discovered inside an oil and gas organization in the MENA region, infiltrating systems and pilfering data, apparently for more than a year. Clearsky pointed out the attack group may link to Hamas in a public report.", "meta": {"refs": ["https://www.clearskysec.com/wp-content/uploads/2016/01/Operation%20DustySky_TLP_WHITE.pdf  \nhttps://www.clearskysec.com/wp-content/uploads/2016/06/Operation-DustySky2_-6.2016_TLP_White.pdf  \nhttps://www.fireeye.com/blog/threat-research/2013/08/operation-molerats-middle-east-cyber-attacks-using-poison-ivy.html  \nhttp://blog.vectranetworks.com/blog/moonlight-middle-east-targeted-attacks  \nhttps://securelist.com/gaza-cybergang-group1-operation-sneakypastes/90068/"]}, "value": "Molerats", "alias": "Gaza Hackers Team, Gaza cybergang, Operation Molerats, Extreme Jackal, Moonlight, Hamas, Gaza, Molerats"}]}, {"values": [{"description": "MoneyTaker is an attack group uncovered by Group-IB. This group, primarily been targeting card processing systems, including the AWS CBR and SWIFT, has conducted over 20 successful attacks on financial institutions and legal firms in the USA, UK and Russia. In addition to banks, the MoneyTaker group has attacked law firms and also financial software vendors.", "meta": {"refs": ["https://www.bleepingcomputer.com/news/security/moneytaker-hacker-group-steals-millions-from-us-and-russian-banks/  \nhttps://www.group-ib.com/resources/reports/money-taker.html  \nhttps://www.group-ib.com/blog/moneytaker"]}, "value": "MoneyTaker", "alias": ""}]}, {"values": [{"description": "MuddyWater, named by PaloAlto, carried out targeted attacks against the Middle East in 2017. Some other related attacks were observed against surrounding nations and beyond, including targets in India and the USA. MuddyWater attacks are characterized by the use of a slowly evolving PowerShell-based first stage backdoor called “POWERSTATS”.", "meta": {"refs": ["https://researchcenter.paloaltonetworks.com/2017/11/unit42-muddying-the-water-targeted-attacks-in-the-middle-east/"]}, "value": "MuddyWater", "alias": "TEMP.Zagros, Seedworm, MuddyWater"}]}, {"values": [{"description": "Mustang Panda, reported by CrowdStrike, targets non-governmental organizations (NGOs) in general, but uses Mongolian language decoys and themes, suggesting this actor has a specific focus on gathering intelligence on Mongolia. These campaigns involve the use of shared malware like Poison Ivy or PlugX.", "meta": {"refs": ["https://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-june-mustang-panda/"]}, "value": "Mustang Panda", "alias": "Temp.Hex, HoneyMyte, Mustang Panda, Mustang Panda"}]}, {"values": [{"description": "The massive NotPetya ransomware outbreak that crippled organizations around the world in 2017 was connected to TeleBots by ESET. While the malware has a ransomware component, NotPetya can’t decrypt victims’ disk, even if a payment is made. It contains worm-like features to spread itself across a computer network using the SMBv1 exploits EternalBlue and EternalRomance.", "meta": {"refs": ["https://www.eset.com/us/about/newsroom/press-releases/eset-researchers-discover-links-between-two-major-cybersecurity-attacks-notpetya-and-industroyer/"]}, "value": "NotPetya", "alias": ""}]}, {"values": [{"description": "OceanLotus is an APT organization that was first disclosed and named by QiAnxin. The APT group carried out targeted attacks against Chinese government, research institutes, maritime institutions, and shipping companies since 2012.\nThe group is called as APT32 by FireEye. It is observed that APT32 also targeted corporations with a vested interest in Vietnam’s manufacturing, consumer products, and hospitality sectors. Furthermore, it has also targeted foreign governments, as well as Vietnamese dissidents and journalists since at least 2013.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2017/05/cyber-espionage-apt32.html  \nhttps://www.cybereason.com/labs-operation-cobalt-kitty-a-large-scale-apt-in-asia-carried-out-by-the-oceanlotus-group/  \nhttps://www.scmagazineuk.com/ocean-lotus-groupapt-32-identified-as-vietnamese-apt-group/article/663565/"]}, "value": "OceanLotus", "alias": "OceanLotus, 海莲花, Cobalt Kitty , APT-C-00, SeaLotus"}]}, {"values": [{"description": "OilRig is a suspected Iranian threat group that has targeted Middle Eastern and international victims since at least 2014. Its targets contain a variety of industries, including financial, government, energy, chemical, and telecommunications. It appears the group carries out supply chain attacks, leveraging the trust relationship between organizations to attack their primary targets.\nFireEye assesses that the group works on behalf of the Iranian government. This group was previously tracked under two distinct groups, APT34 and OilRig, but was combined due to additional reporting giving higher confidence about the overlap of the activity.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2016/05/targeted_attacksaga.html  \nhttp://researchcenter.paloaltonetworks.com/2016/10/unit42-oilrig-malware-campaign-updates-toolset-and-expands-targets/  \nhttp://researchcenter.paloaltonetworks.com/2016/05/the-oilrig-campaign-attacks-on-saudi-arabian-organizations-deliver-helminth-backdoor/  \nhttp://www.clearskysec.com/oilrig/  \nhttps://cert.gov.il/Updates/Alerts/SiteAssets/CERT-IL-ALERT-W-120.pdf  \nhttp://researchcenter.paloaltonetworks.com/2017/04/unit42-oilrig-actors-provide-glimpse-development-testing-efforts/  \nhttp://blog.morphisec.com/iranian-fileless-cyberattack-on-israel-word-vulnerability%20  \nhttps://www.forbes.com/sites/thomasbrewster/2017/02/15/oilrig-iran-hackers-cyberespionage-us-turkey-saudi-arabia/#56749aa2468a  \nhttps://researchcenter.paloaltonetworks.com/2017/07/unit42-twoface-webshell-persistent-access-point-lateral-movement/  \nhttps://researchcenter.paloaltonetworks.com/2017/12/unit42-introducing-the-adversary-playbook-first-up-oilrig/  \nhttps://pan-unit42.github.io/playbook_viewer/  \nhttps://raw.githubusercontent.com/pan-unit42/playbook_viewer/master/playbook_json/oilrig.json  \nhttps://www.clearskysec.com/oilrig/  \nhttps://pan-unit42.github.io/playbook_viewer/  \nhttps://researchcenter.paloaltonetworks.com/2018/11/unit42-analyzing-oilrigs-ops-tempo-testing-weaponization-delivery/"]}, "value": "OilRig", "alias": "Greenbug, Chrysene, Shamoon 2, Twisted Kitten, Cobalt Gypsy, PIPEFISH, OilRig"}]}, {"values": [{"description": "Most of the targets are from the Middle East: Israel, Egypt, Saudi Arabia, United Arab Emirates and Iraq. The United States and countries in Europe are targeted as well. Targeted sectors include governmental and diplomatic institutions, including embassies; companies from the aerospace and defense Industries; financial institutions; journalists; software developers.", "meta": {"refs": ["https://www.clearskysec.com/wp-content/uploads/2016/01/Operation%20DustySky_TLP_WHITE.pdf"]}, "value": "Operation Dustysky", "alias": ""}]}, {"values": [{"description": "Operation Ghoul, traced back to 2015, targeted industrial, manufacturing and engineering organizations in more than 30 countries. Over 130 organizations have been identified as victims of this campaign and most of them are Small to Medium size businesses.", "meta": {"refs": ["https://securelist.com/operation-ghoul-targeted-attacks-on-industrial-and-engineering-organizations/75718/"]}, "value": "Operation Ghoul", "alias": ""}]}, {"values": [{"description": "Orangeworm, named by Symantec, targeted organizations in the healthcare sector in the United States, Europe, and Asia since at least 2015, likely to perform corporate espionage. Related custom backdoor is called Trojan.Kwampirs.", "meta": {"refs": ["https://www.symantec.com/blogs/threat-intelligence/orangeworm-targets-healthcare-us-europe-asia"]}, "value": "Orangeworm", "alias": ""}]}, {"values": [{"description": "Outlaw group, uncovered by TrendMicro, distributes Botnet for cryptocurrency mining, scanning, and brute-force. The attacking bot used a tool called haiduc to search the internet for systems to attack.", "meta": {"refs": ["https://blog.trendmicro.com/trendlabs-security-intelligence/outlaw-group-distributes-botnet-for-cryptocurrency-mining-scanning-and-brute-force/"]}, "value": "Outlaw", "alias": ""}]}, {"values": [{"description": "Pacha group deploys undetected cryptojacking campaigns on Linux servers. Related malwares are named as Linux.Antd and Linux.GreedyAntd. Malware authors are reported to be from China.", "meta": {"refs": ["https://www.intezer.com/blog-technical-analysis-pacha-group/"]}, "value": "Pacha Group", "alias": ""}]}, {"values": [{"description": "Patchwork, also known as Hangover, is a targeted attack that has infected an estimated 2,500 machines since it was first observed in December 2015. While the group has not been definitively attributed, circumstantial evidence suggests the group may be a pro-Indian or Indian entity.\nPatchwork targeted industries related to diplomatic and government agencies such as military and political assignments, especially those working on issues relating to Southeast Asia and the South China Sea. Affected systems including Windows, Android and Mac OS.\nThis attack group may have connection to Confucius and Bitter. Lots of exploits have been used in targeted attacks and at least one of them is 0-day.", "meta": {"refs": ["http://www.symantec.com/connect/blogs/patchwork-cyberespionage-group-expands-targets-governments-wide-range-industries  \nhttps://blogs.forcepoint.com/security-labs/monsoon-analysis-apt-campaign  \nhttps://www.cymmetria.com/patchwork-targeted-attack/"]}, "value": "PatchWork", "alias": "Hangover, Viceroy Tiger, 摩诃草, Dropping Elephant, MONSOON, 白象, 丰收行动, Chinastrats, Sarit, APT-C-09, PatchWork"}]}, {"values": [{"description": "PINCHY SPIDER is the creator of GandCrab that targets the ransomware at enterprise environments. PINCHY SPIDER and its affiliates were found using techniques mainly associated with penetration testing teams as well as other adversary groups. It is also believed to be offering their share of profits to other entities spreading GandCrab.", "meta": {"refs": ["https://cyware.com/news/gandcrab-creator-pinchy-spider-and-its-affiliates-update-tactics-to-spread-the-ransomware-0f777fb1?from=singlemessage&isappinstalled=0&tdsourcetag=s_pcqq_aiomsg"]}, "value": "PINCHY SPIDER", "alias": ""}]}, {"values": [{"description": "The name of PKPLUG, created by PaloAlto, comes from the tactic of delivering PlugX malware inside ZIP archive files as part of a DLL side-loading package.\nMost of the malware frequently being used by PKPLUG is PlugX. The additional payloads include HenBox, an Android app, and Farseer, a Windows backdoor. The attackers also use the 9002 Trojan, which is believed to be shared among a small subset of attack groups. Other publicly available malware seen in relation to PKPLUG activity includes Poison Ivy and Zupdax. The ultimate objectives of PKPLUG are not entirely clear, but installing backdoor Trojan implants on victim systems, including mobile devices, infers tracking victims and gathering information.", "meta": {"refs": ["https://unit42.paloaltonetworks.com/pkplug_chinese_cyber_espionage_group_attacking_asia/"]}, "value": "PKPLUG", "alias": ""}]}, {"values": [{"description": "PowerPool, disclosed by ESET, has a small number of victims in Chile, Germany, India, Philippine, Poland, Russia, the United Kingdom, the United States and Ukraine. The attack group utilizes Symbolic Link (.slk) files to distribute their malware and exploits zero-day vulnerability in the wild, only two days after its disclosure.", "meta": {"refs": ["https://www.welivesecurity.com/2018/09/05/powerpool-malware-exploits-zero-day-vulnerability/"]}, "value": "PowerPool", "alias": ""}]}, {"values": [{"description": "PowerSniff, named by PaloAlto, is a malware of the Gozi group developed on the base of isfb. It uses Office Macros and PowerShell in documents distributed in e-mail messages to inject malware directly into memory.", "meta": {"refs": ["https://malpedia.caad.fkie.fraunhofer.de/details/win.powersniff"]}, "value": "PowerSniff", "alias": ""}]}, {"values": [{"description": "ProjectSauron, also known as Strider, is a threat group that has been active since at least 2011 and targeted victims in Russia, China, Sweden, Belgium, Iran, and Rwanda. The group has maintained a low profile and its targets have been mainly organizations and individuals that would be of interest to a nation state’s intelligence services.\n\nThe Remsec malware used by ProjectSauron has a modular design. Its modules work together as a framework that provides the attackers with complete control over an infected computer, allowing them to move across a network, exfiltrate data, and deploy custom modules as required. \n\nThe APT group is able to exfiltrate data from air-gapped networks by using specially-prepared USB storage drives where data is stored in an area invisible to the operation system. Based on the espionage capabilities of its malware and the nature of its known targets, it is possible that the group is a nation-state level attacker.", "meta": {"refs": ["https://securelist.com/analysis/publications/75533/faq-the-projectsauron-apt/  \nhttps://www.symantec.com/connect/blogs/strider-cyberespionage-group-turns-eye-sauron-targets"]}, "value": "projectsauron", "alias": "Strider, Sauron, ProjectSauron, 索伦之眼, projectsauron"}]}, {"values": [{"description": "Promethium, uncovered by Microsoft, is an activity group that has been active as early as 2012. The group primarily uses Truvasys as a first-stage malware that masquerades as one of server common computer utilities, including WinUtils, TrueCrypt, WinRAR, or SanDisk. In each of the campaigns, Truvasys malware evolved with additional features—this shows a close relationship between the activity groups behind the campaigns and the developers of the malware.\nPromethium conducted a campaign in May 2016 and has heavily targeted Turkish victims. It has demonstrated similarity to another activity group called Neodymium due to overlapping victim and campaign characteristics.", "meta": {"refs": ["https://blogs.technet.microsoft.com/mmpc/2016/12/14/twin-zero-day-attacks-promethium-and-neodymium-target-individuals-in-europe/  \nhttps://www.virusbulletin.com/conference/vb2016/abstracts/last-minute-paper-strongpity-waterhole-attacks-targeting-italian-and-belgian-encryption-users"]}, "value": "PROMETHIUM", "alias": "StrongPity, PROMETHIUM"}]}, {"values": [{"description": "PUSIKURAC, disclosed by Morphisec, is a threat actor specifically focuses on information stealing and .NET evasion. Before executing the attacks, it registers domains through FreeDns services. It also utilizes legitimate free text storage services like paste, signs its executables, heavily missuses commercial .NET packers and embeds payloads within video files and images.", "meta": {"refs": ["http://blog.morphisec.com/new-campaign-delivering-orcus-rat"]}, "value": "PUSIKURAC", "alias": ""}]}, {"values": [{"description": "Rancor, disclosed by PaloAlto, is a threat group that performed highly targeted attacks against the South East Asia region. It uses politically-motivated lures to entice victims to open malicious documents. Singapore and Cambodia are included, but not limited to its targeted countries.\nThe Rancor group’s attacks use two primary malware families named as DDKONG and PLAINTEE. DDKONG is used throughout the campaign and PLAINTEE appears to be new addition to these attackers’ toolkit.", "meta": {"refs": ["https://researchcenter.paloaltonetworks.com/2018/06/unit42-rancor-targeted-attacks-south-east-asia-using-plaintee-ddkong-malware-families/"]}, "value": "RANCOR", "alias": "Rancor group, RANCOR"}]}, {"values": [{"description": "Operation Red Signature, uncovered by Trend Micro, is an information theft-driven supply chain attack targeting organizations in South Korea. The threat actors compromised the update server of a remote support solutions provider to deliver a remote access tool called 9002 RAT to their targets of interest through the update process.", "meta": {"refs": ["https://blog.trendmicro.com/trendlabs-security-intelligence/supply-chain-attack-operation-red-signature-targets-south-korean-organizations/"]}, "value": "Red Signature", "alias": ""}]}, {"values": [{"description": "APT34 is reported to get involved in a long-term cyber espionage operation largely focused on reconnaissance efforts to benefit Iranian nation-state interests. It has been in operational since at least 2014 and conducted broad targeting across a variety of industries, including financial, government, energy, chemical, and telecommunications.\nAPT34 uses a mix of public and non-public tools, often conducting spear phishing operations using compromised accounts, sometimes coupled with social engineering tactics.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2017/12/targeted-attack-in-middle-east-by-apt34.html  \nhttps://www.fireeye.com/content/dam/collateral/en/mtrends-2018.pdf  \nhttps://www.wired.com/story/apt-34-iranian-hackers-critical-infrastructure-companies/  \nhttps://www.fireeye.com/blog/threat-research/2017/12/targeted-attack-in-middle-east-by-apt34.html  \nhttps://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-november-helix-kitten/  \nhttps://misterch0c.blogspot.com/2019/04/apt34-oilrig-leak.html?m=1&from=timeline&isappinstalled=0"]}, "value": "APT34", "alias": "Helix Kitten, Crambus, APT34"}]}, {"values": [{"description": "Cobalt Group is a financially motivated threat group that has primarily targeted financial institutions. The group has conducted intrusions to steal money via targeting ATM systems, card processing, payment systems and even SWIFT systems. It mainly targeted banks in Eastern Europe, Central Asia, and Southeast Asia. Reporting indicates there may be links between Cobalt Group and Carbanak/Anunak", "meta": {"refs": ["https://www.helpnetsecurity.com/2016/11/22/cobalt-hackers-synchronized-atm-heists/  \nhttps://researchcenter.paloaltonetworks.com/2018/10/unit42-new-techniques-uncover-attribute-cobalt-gang-commodity-builders-infrastructure-revealed/"]}, "value": "Cobalt Group", "alias": "Cobalt Gang, COBALT SPIDER, TEMP.Metastrike, GOLD KINGSWOOD, Cobalt Group"}]}, {"values": [{"description": "Gallmaker, named by Symantec, has been operating since at least December 2017, with its most recent activity observed in June 2018. It targets government and military, including several overseas embassies of an Eastern European country, as well as military and defense targets in the Middle East. This attack group eschews custom malware and uses living off the land (LotL) tactics and publicly available hack tools to carry out cyber-espionage campaign.", "meta": {"refs": ["https://www.symantec.com/blogs/threat-intelligence/gallmaker-attack-group"]}, "value": "Gallmaker", "alias": ""}]}, {"values": [{"description": "KingSqlZ is a Turkish attack group disclosed by ADLab. It carried out targeted attacks against government agencies and energy companies in the Spanish-speaking region", "meta": {"refs": ["https://mp.weixin.qq.com/s/jF1Gg7Lo-2NGti2n6k5zlA"]}, "value": "KingSqlZ", "alias": ""}]}, {"values": [{"description": "NARWHAL SPIDER is designated by CrowdStrike for the criminal operator of Cutwail version 2. It primarily provides spam services with a large customer base that has included malware operators such as WIZARD SPIDER (developer of TrickBot), affiliates of BAMBOO SPIDER (developer of Panda Zeus), and many others including URLZone, Nymaim and Gozi ISFB.", "meta": {"refs": ["https://www.crowdstrike.com/blog/cutwail-spam-campaign-uses-steganography-to-distribute-urlzone/"]}, "value": "NARWHAL SPIDER", "alias": ""}]}, {"values": [{"description": "RedAlpha, uncovered by Recorded Future, is reported to be a cyberespionage campaign targeting the Tibetan community. It combines light reconnaissance, selective targeting, and diverse malicious tooling.", "meta": {"refs": ["https://aptmap.netlify.com/#RedAlpha  \nhttps://www.recordedfuture.com/redalpha-cyber-campaigns/"]}, "value": "RedAlpha", "alias": "Insikt, RedAlpha"}]}, {"values": [{"description": "The enigmatic Roma225 campaign utilizes espionage malware implant weaponized to target companies in the Italian automotive sector. The malware was spread through well written phishing email trying to impersonate a senior partner of one of the major Brazilian business law firms.", "meta": {"refs": ["https://blog.yoroi.company/research/the-enigmatic-roma225-campaign/"]}, "value": "Roma225", "alias": ""}]}, {"values": [{"description": "", "meta": {"refs": [""]}, "value": "Rover", "alias": ""}]}, {"values": [{"description": "Ryuk is a ransomware that encrypts files on a compromised computer and then demands payment, typically in Bitcoin, to decrypt them. Cybercriminals had targeted over 100 US and international businesses with Ryuk ransomware since August 2018. It was being used exclusively for targeted attacks, with its main targets being the critical assets of its victims.", "meta": {"refs": ["https://thenextweb.com/hardfork/2019/10/07/us-hospitals-pay-bitcoin-cryptocurrency-to-survive-ryuk-ransomware-attack/"]}, "value": "Ryuk", "alias": ""}]}, {"values": [{"description": "Sandworm Team is reported to be a Russian cyber espionage group that has operated since approximately 2009. It targets industrial control systems for espionage, denial of service, and data destruction purposes. Some reports pointed out that the threat actor is linked to the 2015 compromise of the Ukrainian electrical grid and a distributed denial of service.\n\nTeleBot is one of the malwares utilized by SandWorm and some of its attack tools are similar to BlackEnergy.", "meta": {"refs": ["http://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/  \nhttp://www.isightpartners.com/2014/10/cve-2014-4114/  \nhttp://www.isightpartners.com/2016/01/ukraine-and-sandworm-team/  \nhttps://dragos.com/blog/crashoverride/CrashOverride-01.pdf  \nhttps://www.us-cert.gov/ncas/alerts/TA17-163A  \nhttps://ics.sans.org/blog/2016/01/09/confirmation-of-a-coordinated-attack-on-the-ukrainian-power-grid  \nhttps://www.fireeye.com/blog/threat-research/2016/01/ukraine-and-sandworm-team.html  \nhttps://www.welivesecurity.com/2018/10/11/new-telebots-backdoor-linking-industroyer-notpetya/"]}, "value": "Sandworm", "alias": "Sandworm Team, Quedagh, Voodoo Bear, TEMP.Noble, TeleBots, Sandworm"}]}, {"values": [{"description": "Scarlet Mimic, named by PaloAlto, is likely a well-funded and skillfully resourced cyber adversary. It has carried out attacks using both spear-phishing and watering holes since at least 2009 with increasingly advanced malware, and has deployed malware including FakeM, Psylo, and MobileOrder, to attack multiple operating systems and platforms.", "meta": {"refs": ["http://researchcenter.paloaltonetworks.com/2016/01/scarlet-mimic-years-long-espionage-targets-minority-activists/"]}, "value": "Scarlet Mimic", "alias": ""}]}, {"values": [{"description": "SEA, the Syrian Electronic Network Army, first appeared on the Internet in 2011 to support the Syrian President’s Ashad government through spam, website scams, malware, phishing and denial-of-service attacks to attack opposition parties, Western news organizations, and human rights organizations. It also invaded government websites in the Middle East and Europe as well as US defense contractors.", "meta": {"refs": ["http://www.crowdstrike.com/blog/dns-lifeblood-your-domain/  \nhttps://i.blackhat.com/eu-18/Wed-Dec-5/eu-18-DelRosso-Under-the-SEA.pdf"]}, "value": "SEA", "alias": ""}]}, {"values": [{"description": "Operation ShadowHammer, discovered by Kaspersky, is a sophisticated supply chain attack that leveraged ASUS Live Update software. The attack took place between June and November 2018 and affected a large number of users. The goal of the attack was to surgically target an unknown pool of users, which were identified by their network adapters’ MAC addresses.", "meta": {"refs": ["https://securelist.com/operation-shadowhammer/89992/"]}, "value": "ShadowHammer", "alias": ""}]}, {"values": [{"description": "Shamoon 3, discovered by PaloAlto, shares a considerable amount of code with the Disttrack malware used in the Shamoon 2 attacks. It targets \noil and gas organization in the Middle East.\nUnlike past Shamoon attacks, this particular Disttrack wiper would overwrite the MBR partitions, and files on the system with randomly generated data rather than overwriting files with an image.\nOne of the compromised organization in Saudi Arabia was also hit by Elfin (APT33).", "meta": {"refs": ["https://researchcenter.paloaltonetworks.com/2018/12/shamoon-3-targets-oil-gas-organization/  \nhttps://www.symantec.com/blogs/threat-intelligence/shamoon-destructive-threat-re-emerges-new-sting-its-tail"]}, "value": "Shamoon 3", "alias": ""}]}, {"values": [{"description": "SideWinder, disclosed by Tencent, is suspected to be an Indian APT group and carries out attacks against military targets in Pakistan and South Asia countries since 2012.", "meta": {"refs": ["https://medium.com/@Sebdraven/apt-sidewinder-changes-theirs-ttps-to-install-their-backdoor-f92604a2739  \nhttps://mp.weixin.qq.com/s/R8PuCGpUEbl8kXxNEeENHQ"]}, "value": "Sidewinder", "alias": "响尾蛇, APT-C-17, Sidewinder"}]}, {"values": [{"description": "The first incident relating to Silence was detected by Group-IB in June 2016. They are selective in their attacks and wait for about three months between incidents. New techniques and approaches are applied to steal from various banking systems, including AWS CBR, ATMs, and card processing.\n\nThe members of Silence are Russian speakers and main targets are located in Russia. In 2019, Silence is one of the most active threat actors targeting the financial sector. They gradually shifting their focus from Russia to former Soviet countries, and then the world.", "meta": {"refs": ["https://www.group-ib.com/resources/threat-research/silence.html  \nhttps://reaqta.com/2019/01/silence-group-targeting-russian-banks/  \nhttps://www.fortinet.com/blog/threat-research/silence-group-playbook.html"]}, "value": "Silence", "alias": ""}]}, {"values": [{"description": "Slingshot, uncovered by Kaspersky, compromised thousands of devices through breached routers in various African and Middle Eastern countries, including Afghanistan, Iraq, Kenya, Sudan, Somalia, Turkey and Yemen.\n\nIt is reported that Slingshot represents a U.S. military program run out of Joint Special Operations Command (JSOC), a component of Special Operations Command (SOCOM). It helped the military and intelligence community collect information about terrorists by infecting computers they commonly used.", "meta": {"refs": ["https://securelist.com/apt-slingshot/84312/"]}, "value": "Slingshot", "alias": ""}]}, {"values": [{"description": "Snake Wine group, named by Cylance, has proven to be highly adaptable and has continued to adopt new tactics in order to establish footholds inside victim environments. The group starts to build and utilize their existing current attack infrastructure and has special interests in Japanese government, education, and commerce.", "meta": {"refs": ["https://www.cylance.com/en_us/blog/the-deception-project-a-new-japanese-centric-threat.html"]}, "value": "Snake Wine", "alias": "ChChes, Snake Wine"}]}, {"values": [{"description": "SocketPlayer, named by Tencent, is a backdoor disguised as video player program targeting government and military units of India, Pakistan and South Korea through spear-phishing and watering hole attacks.", "meta": {"refs": ["https://mp.weixin.qq.com/s/e377pVez-o6rJtFlVTVwyw"]}, "value": "SocketPlayer", "alias": "SocketPlayer, ShadowSnake, 蛇影"}]}, {"values": [{"description": "Sowbug is a threat group identified by Symantec that has conducted highly targeted attacks against organizations in South America and Southeast Asia, particularly government entities since at least 2015. The group is well resourced, capable of infiltrating multiple targets simultaneously and often operate outside the working hours of targeted organizations in order to maintain a low profile while stealing documents. Affected organizations include foreign policy institutions and diplomatic targets.", "meta": {"refs": ["https://www.symantec.com/connect/blogs/sowbug-cyber-espionage-group-targets-south-american-and-southeast-asian-governments"]}, "value": "Sowbug", "alias": ""}]}, {"values": [{"description": "Suckfly, uncovered by Symantec, is an advanced cyberespionage group that conducted attacks against a number of South Korean organizations to steal digital certificates since 2014. The attacks targeted high-profile targets, including government and commercial organizations.\n\nLarge corporations that play a major role in India’s economy were also affected, including one of India’s largest e-commerce companies, a major Indian shipping company, one of India’s largest financial organizations, and an IT firm that provides support for India’s largest stock exchange. Saudi Arabian government organizations were compromised as well.", "meta": {"refs": ["http://www.symantec.com/connect/blogs/suckfly-revealing-secret-life-your-code-signing-certificates  \nhttp://www.symantec.com/connect/blogs/indian-organizations-targeted-suckfly-attacks"]}, "value": "Suckfly", "alias": ""}]}, {"values": [{"description": "SWEED is a large number of malware distribution campaigns named by Talos, including such notable malware as Formbook, Lokibot and Agent Tesla. It remains consistent across most of their campaigns in their use of spear-phishing emails with malicious attachments.\nSWEED targeted small and medium-sized companies around the world. Based on the TTPs used by this group, SWEED should be considered a relatively amateur actor. They use well-known vulnerabilities, commodity stealers and RATs (Pony, Formbook, UnknownRAT, Agent Tesla, etc.) and appear to rely on kits readily available on hacking forums.", "meta": {"refs": ["https://www.symantec.com/connect/blogs/sowbug-cyber-espionage-group-targets-south-american-and-southeast-asian-governments  \nhttps://blog.talosintelligence.com/2019/07/sweed-agent-tesla.html"]}, "value": "SWEED", "alias": ""}]}, {"values": [{"description": "TA505 is a financially motivated threat group uncovered by Proofpoint and has been active since at least 2014. The group was responsible for hundreds of Dridex campaigns beginning in 2014 and massive Locky campaigns in 2016 and 2017, many of which involved hundreds of millions of malicious messages distributed worldwide.", "meta": {"refs": ["https://www.proofpoint.com/us/threat-insight/post/trat-new-modular-rat-appears-multiple-email-campaigns  \nhttps://www.anquanke.com/post/id/170390  \nhttps://blog.yoroi.company/research/the-stealthy-email-stealer-in-the-ta505-arsenal/"]}, "value": "TA505", "alias": "SectorJ04, TA505"}]}, {"values": [{"description": "TA555 is an attack group that carry out campaigns targeting hotels, restaurants, and telecommunications since May, 2018. There are two related malwares: AdvisorsBot and PoshAdvisor.", "meta": {"refs": ["https://www.proofpoint.com/us/threat-insight/post/new-modular-downloaders-fingerprint-systems-part-2-advisorsbot"]}, "value": "TA555", "alias": ""}]}, {"values": [{"description": "Taidoor, an attack group disclosed by Trend Micro, has operated since at least 2009 and primarily targeted Taiwan, China. It exploits a wide variety of vulnerabilities as attack vectors in Microsoft Office and Adobe Reader.", "meta": {"refs": ["https://www.trendmicro.de/cloud-content/us/pdfs/security-intelligence/white-papers/wp_the_taidoor_campaign.pdf"]}, "value": "Taidoor", "alias": ""}]}, {"values": [{"description": "TajMahal is a complex APT framework disclosed by Kaspersky in 2018. There are more than 80 modules stored in VFS allowing for all kinds of attack scenarios and the earliest compiled timestamp is August, 2013.\nConsidering the complexity and duration of the attack, only one victim has been confirmed to date suggests only that others have yet to be identified.", "meta": {"refs": ["https://securelist.com/project-tajmahal/90240/  \nhttps://www.kaspersky.com/blog/taj-mahal-apt/26370/"]}, "value": "TajMahal", "alias": "Project TajMahal, TajMahal"}]}, {"values": [{"description": "SLoad (tracked as TH-163) is the protagonist of an increasing and persistent wave of attacks against Italian organizations since Q3 2018 with high quality phishing emails. As reported by Proofpoint, the targeted countries include the UK and Canada as well.", "meta": {"refs": ["https://securityaffairs.co/wordpress/92138/malware/sload-italian-attacks.html"]}, "value": "TH-163", "alias": ""}]}, {"values": [{"description": "Thrip, uncovered by Symantec, is an espionage group that has targeted satellite communications, telecoms, and defense contractor companies in the U.S. and Southeast Asia. It uses a mixture of custom malware and living off the land tools to perform attacks.", "meta": {"refs": ["https://www.symantec.com/blogs/threat-intelligence/thrip-hits-satellite-telecoms-defense-targets"]}, "value": "Thrip", "alias": ""}]}, {"values": [{"description": "Tick is longstanding cyberespionage campaign discovered by Symantec. It has maintained a low profile, appearing to be active for at least 10 years prior to discovery. It employed spear-phishing emails and compromised a number of Japanese websites in order to infect a new wave of victims.\n\nAttacks carried out by Tick have concentrated on the technology, aquatic engineering, and broadcasting sectors in Japan for espionage purposes.", "meta": {"refs": ["https://www.symantec.com/connect/blogs/tick-cyberespionage-group-zeros-japan  \nhttps://www.secureworks.jp/resources/rp-bronze-butler  \nhttps://researchcenter.paloaltonetworks.com/2017/07/unit42-tick-group-continues-attacks/  \nhttp://blog.jpcert.or.jp/2017/08/detecting-datper-malware-from-proxy-logs.html  \nhttps://blog.trendmicro.com/trendlabs-security-intelligence/redbaldknight-bronze-butler-daserf-backdoor-now-using-steganography/  \nhttps://www.secureworks.com/research/bronze-butler-targets-japanese-businesses"]}, "value": "Tick", "alias": "BRONZE BUTLER, REDBALDKNIGHT, Tick Group, Bald Knight, Tick"}]}, {"values": [{"description": "In July 2018, the Venus Chenchen Eye Safety Research Team captured a new class of targeted attack samples, dating back to the organization’s earliest activity in 2013, which named the APT organization “狼毒草” and considered it The organization is very familiar with Chinese. It was also found that its early samples were related to TOOHASH disclosed by G DATA.", "meta": {"refs": ["https://mp.weixin.qq.com/s?__biz=MzA3NDQ0MzkzMA==&mid=2651677009&idx=1&sn=44a9f62303ffcf154c11b46fdfa9de55&chksm=84867ca4b3f1f5b2316119a2892d4d19adef3542aa5adc0d70ed9493d0468b2b96a387adc3b4&scene=0#rd"]}, "value": "TOOHASH", "alias": "Wolfsbane, TOOHASH, 狼毒草"}]}, {"values": [{"description": "Tortoiseshell, uncovered by Symantec, targets IT providers in Saudi Arabia in what appears to be supply chain attacks with the end goal of compromising the IT providers’ customers since at least July 2018.", "meta": {"refs": ["https://www.symantec.com/blogs/threat-intelligence/tortoiseshell-apt-supply-chain"]}, "value": "Tortoiseshell", "alias": "Tortoiseshell Group, Tortoiseshell"}]}, {"values": [{"description": "TRITON, named by FireEye, is an attack framework built to interact with Triconex Safety Instrumented System (SIS) controllers. It is one of a limited number of publicly identified malicious software families targeted at industrial control systems (ICS). It could prevent safety mechanisms from executing their intended function, resulting in a physical consequence. \nWhen the attacker gained remote access to an SIS engineering workstation, the TRITON attack framework was deployed to reprogram the SIS controllers, to modify application memory on SIS controllers that could lead to a failed validation check.", "meta": {"refs": ["https://www.fireeye.com/blog/threat-research/2018/10/triton-attribution-russian-government-owned-lab-most-likely-built-tools.html   \nhttps://www.fireeye.com/blog/threat-research/2017/12/attackers-deploy-new-ics-attack-framework-triton.html   \nhttps://dragos.com/adversaries.html  \nhttps://www.fireeye.com/blog/threat-research/2019/04/triton-actor-ttp-profile-custom-attack-tools-detections.html"]}, "value": "TRITON", "alias": "TEMP.Veles, TRISIS, XENOTIME, HATMAN, TRITON"}]}, {"values": [{"description": "Founded in 2004, Turkhackteam is one of Turkey’s oldest and most high-profile hacking collectives that has carried out almost 30 highly publicized hacking campaigns targeting foreign government and commercial websites, including websites of international corporations.", "meta": {"refs": ["https://www.turkhackteam.org/  \nhttps://twitter.com/Turk_Hack__Team"]}, "value": "TurkHackTeam", "alias": "Turk Hack Team, TurkHackTeam"}]}, {"values": [{"description": "Turla, named by Kaspersky and also known as Snake or Uroburos, is a Russian-based threat group that has infected victims in over 45 countries through watering hole and spear-phishing campaigns, spanning a range of industries including government, embassies, military, education, research and pharmaceutical companies since 2004.\nThe initial targets are Western countries and subsequently moved to embassies in Eastern Europeans, such as Belgium, Ukraine, China, Jordan, Greece, Kazakhstan, Armenia, Poland and Germany. The US Central Command was attacked in 2008. In May 2012, the Prime Minister’s office of the former Soviet Union’s member states was attacked and more than 60 machines were infected. Other victims include the Western European Ministry of Health, a Central American National Education Department, a national power company in the Middle East, and a medical institution in the United States.\nTurla’s espionage platform is mainly used against Windows machines, but has also been seen used against macOS and Linux machines. Related malwares are Mosquito, Skipper, LightNeuron, etc.", "meta": {"refs": ["https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/  \nhttps://attack.mitre.org/groups/G0010/  \nhttps://securelist.com/the-epic-turla-operation/65545/  \nhttps://securelist.com/satellite-turla-apt-command-and-control-in-the-sky/72081/"]}, "value": "Turla", "alias": "Turla Group, Snake, Venomous Bear, Group 88, Waterbug, WRAITH, Turla Team, Uroburos, Pfinet, TAG_0530, KRYPTON, Hippo Team, WhiteBear, Skipper Turla, Turla"}]}, {"values": [{"description": "Unit 8200, also known as Duqu, is a collection of computer malware discovered by CrySyS Labs in Hungary on September 1, 2011, which is believed to be related to the Stuxnet worm and was created by Israeli Intelligence Unit 8200.\nSubsequent analysis by Symantec found that Duqu was nearly identical to Stuxnet, but with a completely different purpose. Like Stuxnet, Duqu attacks Microsoft Windows systems using a zero-day vulnerability. The first-known installer (AKA dropper) file recovered and disclosed by CrySyS Lab uses a Microsoft Word document that exploits the Win32k TrueType font parsing engine and allows execution.\nIn 2015, Kaspersky discovered a network intrusion that affected its internal systems and discovered a new malware platform, sourced from Duqu and named it Duqu 2.0.", "meta": {"refs": ["https://en.wikipedia.org/wiki/Duqu  \nhttps://securelist.com/blog/research/70504/the-mystery-of-duqu-2-0-a-sophisticated-cyberespionage-actor-returns/  \nhttps://archive.org/details/Stuxnet"]}, "value": "Unit 8200", "alias": "Duqu, Duqu Group, Unit 8200"}]}, {"values": [{"description": "Urpage, named by Trend Micro, shares connection with Confucius, Patchwork, and Bahamut. \nIt targets InPage, a word processor for Urdu and Arabic languages. Its Delphi backdoor component has in common with Confucius and Patchwork, and its apparent use of Bahamut-like malware makes it more intriguing as it connects Urpage to these other known threats. Related Android samples were captured as well.", "meta": {"refs": ["https://blog.trendmicro.com/trendlabs-security-intelligence/the-urpage-connection-to-bahamut-confucius-and-patchwork/"]}, "value": "Urpage", "alias": ""}]}, {"values": [{"description": "White Company, uncovered by Cylance, is a well-resourced group targeting Pakistan’s Air Force through Operation Shaheen campaign. It possesses considerable resources that support the likelihood that the organization is part of a state-sponsored group.", "meta": {"refs": ["https://www.cylance.com/en-us/company/news-and-press/press-releases/cylance-discovers-new-middle-eastern-APT-actor-the-white-company.html"]}, "value": "White Company", "alias": ""}]}, {"values": [{"description": "WindShift targeted specific individuals working in government department and critical infrastructure across the Middle East. Weaknesses of Apple Mac products were exploited to attack victims in that region.", "meta": {"refs": ["https://www.forbes.com/sites/thomasbrewster/2018/08/30/apple-mac-loophole-breached-in-middle-east-hacks/#55d4ac96fd65  \nhttps://gsec.hitb.org/materials/sg2018/D1%20COMMSEC%20-%20In%20the%20Trails%20of%20WINDSHIFT%20APT%20-%20Taha%20Karim.pdf"]}, "value": "WindShift", "alias": ""}]}, {"values": [{"description": "WIRTE, identified by the Intelligence Development Group of S2 Grupo, attacked the Middle East without using very sophisticated mechanisms in August 2018.", "meta": {"refs": ["https://www.securityartwork.es/2019/01/25/wirte-group-attacking-the-middle-east/"]}, "value": "WIRTE", "alias": "WIRTE Group, WIRTE"}]}, {"values": [{"description": "xHunt, uncovered by PaloAlto, is an attack campaign on Kuwait shipping and transportation organizations. The names of the tools collected include backdoor tools Sakabota, Hisoka, Netero and Killua. These tools not only use HTTP for their command and control (C2) channels, but some use DNS tunneling or emails to communicate with their C2 as well.", "meta": {"refs": ["https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"]}, "value": "xHunt", "alias": "SectorD01, xHunt"}]}, {"values": [{"description": "ZooPark, named by Kaspersky, is a sophisticated cyberespionage operation that has been focusing on Android device users in the Middle East countries. The threat actors behind ZooPark infect Android devices using at least four generations of the espionage malware since at least 2015.", "meta": {"refs": ["https://usa.kaspersky.com/about/press-releases/2018_zoopark-new-android-based-malware"]}, "value": "ZooPark", "alias": "军刀狮, APT-C-38, ZooPark"}]}]